In [1]:
%pip install pymysql

Requirement already satisfied: pymysql in c:\users\david\anaconda3\envs\clase\lib\site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)
import numpy as np

### CONEXIÓN A SQL Y CREACIÓN DE BBDD

In [3]:
import mysql.connector as conn
from sqlalchemy import create_engine

In [4]:
df_act=pd.read_csv(r'C:\Users\david\Proyectos\Github\w3-database-project\data_clean/actor_clean.csv')
df_cat=pd.read_csv(r'C:\Users\david\Proyectos\Github\w3-database-project\data_clean/category_clean.csv')
df_film=pd.read_csv(r'C:\Users\david\Proyectos\Github\w3-database-project\data_clean/film_clean.csv')
df_inv=pd.read_csv(r'C:\Users\david\Proyectos\Github\w3-database-project\data_clean/inventory_clean.csv')
df_lang=pd.read_csv(r'C:\Users\david\Proyectos\Github\w3-database-project\data_clean/language_clean.csv')
df_old=pd.read_csv(r'C:\Users\david\Proyectos\Github\w3-database-project\data_clean/old_HDD_clean.csv')
df_ren=pd.read_csv(r'C:\Users\david\Proyectos\Github\w3-database-project\data_clean/rental_clean.csv')

In [6]:
with open('contraseñas.txt', 'r') as file:
    pass_=file.readlines()[0]

In [7]:
str_conn=f'mysql+pymysql://root:{pass_}@localhost:3306' #Conectar al servidor
cursor=create_engine(str_conn) #Cursor que apunta al servidor

In [8]:
#cursor.execute('drop database if exists proy_videoclub;')

In [9]:
#cursor.execute('create database proy_videoclub;')

In [10]:
str_conn=f'mysql+pymysql://root:{pass_}@localhost:3306/proy_videoclub'
cursor=create_engine(str_conn)

### CARGA DE DATOS

In [11]:
#df_act.to_sql(name='actor', con=cursor, if_exists='replace', index=False)
#df_cat.to_sql(name='category', con=cursor, if_exists='replace', index=False)
#df_film.to_sql(name='film', con=cursor, if_exists='replace', index=False)
#df_inv.to_sql(name='inventory', con=cursor, if_exists='replace', index=False)
#df_old.to_sql(name='old_HDD', con=cursor, if_exists='replace', index=False)
#df_ren.to_sql(name='rental', con=cursor, if_exists='replace', index=False)
#df_lang.to_sql(name='language', con=cursor, if_exists='replace', index=False)

### SELECCIÓN DE PRIMARY KEYS Y FOREIGN KEYS. CREACIÓN DE RELACIONES ENTRE TABLAS
Realizado en Workbench. EER Diagram disponible en repositorio.

### SQL QUERIES

In [25]:
#1 CUÁNTAS PELÍCULAS DE LA TABLA PELÍCULAS ESTÁN SIENDO ALQUILADAS?
pd.read_sql('''

SELECT COUNT(R.RENTAL_ID) AS TOTAL_TITLES_FOR_RENT FROM RENTAL AS R
INNER JOIN INVENTORY AS I
ON R.INVENTORY_ID = I.INVENTORY_ID
INNER JOIN FILM AS F
ON I.FILM_ID = F.FILM_ID


''', cursor)

   TOTAL_TITLES_FOR_RENT
0                    212

In [11]:
#2 CUALES SON LAS 5 PELÍCULAS MÁS ALQUILADAS?
pd.read_sql('''

SELECT F.FILM_ID, F.TITLE, COUNT(RENTAL_ID) AS TOTAL_RENT_TIMES FROM RENTAL AS R
LEFT JOIN INVENTORY AS I
ON I.INVENTORY_ID = R.INVENTORY_ID
LEFT JOIN FILM AS F
ON F.FILM_ID = I.FILM_ID
GROUP BY F.TITLE
ORDER BY TOTAL_RENT_TIMES DESC
limit 6

''', cursor)

   FILM_ID                 TITLE  TOTAL_RENT_TIMES
0      NaN                  None               788
1     86.0         BOOGIE AMELIE                 4
2     73.0        BINGO TALENTED                 3
3    109.0    BUTTERFLY CHOCOLAT                 3
4     28.0           ANTHEM LUKE                 3
5     55.0  BARBARELLA STREETCAR                 3

In [12]:
#3--- CUALES SON LOS 10 ACTORES/ACTRICES QUE MÁS SALEN EN LAS PELÍCULAS?
pd.read_sql('''

SELECT A.COMPLETE_NAME, COUNT(A.ACTOR_ID) AS TOTAL_TIMES FROM ACTOR AS A
INNER JOIN OLD_HDD AS O
ON A.ACTOR_ID = O.ACTOR_ID
GROUP BY COMPLETE_NAME
ORDER BY TOTAL_TIMES DESC
LIMIT 10

''', cursor)

   COMPLETE_NAME  TOTAL_TIMES
0  SANDRA KILMER           37
1     VAL BOLGER           35
2       UMA WOOD           35
3   RIP CRAWFORD           33
4  JULIA MCQUEEN           33
5   HELEN VOIGHT           32
6     KARL BERRY           31
7  WOODY HOFFMAN           31
8  VIVIEN BERGEN           30
9   GRACE MOSTEL           30

In [13]:
#4 CUAL ES EL ACTOR QUE MÁS SE REPITE EN LAS PELÍCULAS DE DEPORTES?
pd.read_sql('''

SELECT A.ACTOR_ID, A.COMPLETE_NAME, COUNT(F.TITLE) AS TOTAL_TIMES, O.CATEGORY_ID FROM ACTOR AS A
LEFT JOIN OLD_HDD AS O
ON A.ACTOR_ID = O.ACTOR_ID
LEFT JOIN FILM AS F
ON O.FILM_ID = F.FILM_ID
WHERE O.CATEGORY_ID = 15
GROUP BY COMPLETE_NAME
ORDER BY TOTAL_TIMES DESC
LIMIT 1

''', cursor)

   ACTOR_ID    COMPLETE_NAME  TOTAL_TIMES  CATEGORY_ID
0         6  BETTE NICHOLSON            5           15

In [14]:
#5--- LISTA DE 5 CATEGOÍAS ORDENADAS POR SU RENTAL_RATE MEDIO
pd.read_sql('''

SELECT C.CATEGORY_ID, C.NAME, AVG(F.RENTAL_RATE) AS AVG_RENTAL_RATE FROM CATEGORY AS C
LEFT JOIN OLD_HDD AS O
ON C.CATEGORY_ID = O.CATEGORY_ID
LEFT JOIN FILM AS F
ON O.FILM_ID = F.FILM_ID
GROUP BY NAME
ORDER BY AVG_RENTAL_RATE DESC
LIMIT 5


''', cursor)

   CATEGORY_ID     NAME  AVG_RENTAL_RATE
0           14   Sci-Fi         3.610690
1           16   Travel         3.490000
2            9  Foreign         3.365000
3           15   Sports         3.243164
4           10    Games         3.200526

In [15]:
#6--- ACTORES QUE MENOS REPLACEMENT COST TIENE EN LAS PELÍCULAS
pd.read_sql('''

SELECT A.ACTOR_ID, A.COMPLETE_NAME, AVG(F.REPLACEMENT_COST) AS AVG_REPLACEMENT_COST FROM ACTOR AS A
LEFT JOIN OLD_HDD AS O
ON A.ACTOR_ID = O.ACTOR_ID
INNER JOIN FILM AS F
ON O.FILM_ID = F.FILM_ID
GROUP BY ACTOR_ID
ORDER BY AVG_REPLACEMENT_COST
LIMIT 10


''', cursor)

   ACTOR_ID     COMPLETE_NAME  AVG_REPLACEMENT_COST
0        31    SISSY SOBIESKI             17.656666
1        21   KIRSTEN PALTROW             17.990000
2         3          ED CHASE             18.353636
3        13          UMA WOOD             18.532857
4        23     SANDRA KILMER             18.557567
5         4    JENNIFER DAVIS             18.717272
6        34    AUDREY OLIVIER             18.750000
7         1  PENELOPE GUINESS             18.779473
8        25       KEVIN BLOOM             18.799524
9        37        VAL BOLGER             19.104285

In [16]:
#7--- ACTORES QUE MÁS SALEN EN PELÍCULAS LARGAS SUPERIORES A 2 H

pd.read_sql('''

SELECT A.ACTOR_ID, A.COMPLETE_NAME, COUNT(F.LENGTH) AS TOTAL_TIMES FROM ACTOR AS A
LEFT JOIN OLD_HDD AS O
ON A.ACTOR_ID = O.ACTOR_ID
LEFT JOIN FILM AS F
ON O.FILM_ID = F.FILM_ID
WHERE F.LENGTH>120
GROUP BY ACTOR_ID
ORDER BY TOTAL_TIMES DESC
LIMIT 10



''', cursor)

   ACTOR_ID        COMPLETE_NAME  TOTAL_TIMES
0        23        SANDRA KILMER           20
1        13             UMA WOOD           19
2        16         FRED COSTNER           18
3        26         RIP CRAWFORD           17
4        17         HELEN VOIGHT           17
5        28        WOODY HOFFMAN           16
6        37           VAL BOLGER           15
7         8    MATTHEW JOHANSSON           14
8        38         TOM MCKELLEN           14
9         5  JOHNNY LOLLOBRIGIDA           14

In [19]:
#8 PELÍCULA MÁS LARGA CON MENOS RENTAS (DEBE TENER RENTAS) --- EL PELMAZO
pd.read_sql('''

SELECT S.TITLE, S.RENT_TIMES, MAX(S.LENGTH) AS LENGTH FROM
(SELECT F.TITLE, COUNT(F.FILM_ID) AS RENT_TIMES, F.LENGTH FROM FILM AS F
INNER JOIN INVENTORY AS I
ON F.FILM_ID = I.FILM_ID
INNER JOIN RENTAL AS R
ON I.INVENTORY_ID = R.INVENTORY_ID
GROUP BY F.TITLE) AS S
WHERE RENT_TIMES = 1

''', cursor)

         TITLE  RENT_TIMES  LENGTH
0  AFRICAN EGG           1     185

In [20]:
#9 PELÍCULA DE ACCIÓN CON MÁS ACTORES 
pd.read_sql('''

SELECT F.TITLE, C.NAME, COUNT(O.ACTOR_ID) AS TOTAL_ACTORS FROM FILM AS F
LEFT JOIN OLD_HDD AS O
ON F.FILM_ID = O.FILM_ID
LEFT JOIN CATEGORY AS C
ON O.CATEGORY_ID = C.CATEGORY_ID
GROUP BY F.TITLE
HAVING C.NAME = 'ACTION'
ORDER BY TOTAL_ACTORS DESC
LIMIT 1


''', cursor)

                 TITLE    NAME  TOTAL_ACTORS
0  RINGS HEARTBREAKERS  Action             4

In [21]:
#10 - ACTOR QUE EMPIEZA POR A CON MÁS PELÍCULAS
pd.read_sql('''

SELECT A.ACTOR_ID, A.COMPLETE_NAME, F.TITLE FROM ACTOR AS A
LEFT JOIN OLD_HDD AS O
ON A.ACTOR_ID = O.ACTOR_ID
LEFT JOIN FILM AS F
ON O.FILM_ID = F.FILM_ID
WHERE A.COMPLETE_NAME = 'A%'


''', cursor)

ValueError: unsupported format character ''' (0x27) at index 184

In [22]:
#11 - PELÍCULA DE GÉNERO DE SCI-FI QUE MÁS SE ALQUILA

pd.read_sql('''

SELECT COUNT(C.NAME) AS CATEGORY_NAME, F.TITLE FROM CATEGORY AS C
INNER JOIN OLD_HDD AS O
ON C.CATEGORY_ID = O.CATEGORY_ID
INNER JOIN FILM AS F
ON O.FILM_ID = F.FILM_ID
INNER JOIN INVENTORY AS I
ON F.FILM_ID = I.FILM_ID
INNER JOIN RENTAL AS R
ON I.INVENTORY_ID = R.INVENTORY_ID
WHERE C.NAME = 'Action'
GROUP BY TITLE
ORDER BY CATEGORY_NAME DESC
LIMIT 1

''', cursor)

   CATEGORY_NAME            TITLE
0              4  AMERICAN CIRCUS

In [23]:
#12--- TOP 3 ACTORES QUE MÁS SE ALQUILAN EN EL VIDEO CLUB
pd.read_sql('''

SELECT COUNT(A.ACTOR_ID) AS RENT_TIMES, A.COMPLETE_NAME FROM ACTOR AS A
INNER JOIN OLD_HDD AS O
ON A.ACTOR_ID = O.ACTOR_ID
INNER JOIN FILM AS F
ON O.FILM_ID = F.FILM_ID
INNER JOIN INVENTORY AS I
ON F.FILM_ID = I.FILM_ID
INNER JOIN RENTAL AS R
ON I.INVENTORY_ID = R.INVENTORY_ID
GROUP BY A.COMPLETE_NAME
ORDER BY RENT_TIMES DESC
LIMIT 3

''', cursor)

   RENT_TIMES     COMPLETE_NAME
0          13      RIP CRAWFORD
1          11     SANDRA KILMER
2          10  PENELOPE GUINESS

In [ ]:
#13--- CREAR TABLA CON TODAS LAS ID (NO HE PODIDO HACERLA POR NO PODER APLICAR FULL OUTER JOIN)
pd.read_sql('''



''', cursor)

In [ ]:
# 14. CREAR TABLA CON LAS GANANCIAS POR PELICULA CREATE TABLE IF NOT EXISTS TOTAL_RENTING_COST

pd.read_sql('''

CREATE TABLE IF NOT EXISTS TOTAL_RENTING
SELECT F.FILM_ID, F.TITLE, ROUND(SUM(F.RENTAL_RATE),2) AS TOTAL_RENTING_COST FROM FILM AS F
INNER JOIN INVENTORY AS I
ON F.FILM_ID = I.FILM_ID
INNER JOIN RENTAL AS R
ON I.INVENTORY_ID = R.INVENTORY_ID
GROUP BY F.TITLE
ORDER BY TOTAL_RENTING_COST DESC

''', cursor)

In [24]:
pd.read_sql('''

SELECT * FROM TOTAL_RENTING

''', cursor)

     FILM_ID                   TITLE  TOTAL_RENTING_COST
0       86.0           BOOGIE AMELIE               19.96
1       28.0             ANTHEM LUKE               14.97
2      103.0      BUCKET BROTHERHOOD               14.97
3      117.0          CANDLES GRAPES               14.97
4      131.0         CENTER DINOSAUR               14.97
5      159.0             CLOSER BANG               14.97
6      174.0  CONFIDENTIAL INTERVIEW               14.97
7        8.0         AIRPORT POLLOCK                9.98
8       21.0         AMERICAN CIRCUS                9.98
9       31.0           APACHE DIVINE                9.98
10      48.0     BACKLASH UNDEFEATED                9.98
11      84.0            BOILED DARES                9.98
12      93.0       BRANNIGAN SUNRISE                9.98
13     100.0         BROOKLYN DESERT                9.98
14     112.0       CALENDAR GUNFIGHT                9.98
15     127.0           CAT CONEHEADS                9.98
16     167.0               COMA HEAD                9.98
17     179.0          CONQUERER NUTS                9.98
18     202.0        DADDY PITTSBURGH                9.98
19      55.0    BARBARELLA STREETCAR                8.97
20      73.0          BINGO TALENTED                8.97
21       4.0        AFFAIR PREJUDICE                5.98
22       6.0            AGENT TRUMAN                5.98
23      15.0            ALIEN CENTER                5.98
24      25.0             ANGELS LIFE                5.98
25      42.0      ARTIST COLDBLOODED                5.98
26      43.0          ATLANTIS CAUSE                5.98
27      58.0     BEACH HEARTBREAKERS                5.98
28      59.0          BEAR GRACELAND                5.98
29      78.0        BLACKOUT PRIVATE                5.98
30      83.0          BLUES INSTINCT                5.98
31      96.0           BREAKING HOME                5.98
32     129.0              CAUSE DATE                5.98
33     135.0     CHANCE RESURRECTION                5.98
34     138.0     CHARIOTS CONSPIRACY                5.98
35     158.0        CLONES PINOCCHIO                5.98
36     162.0         CLUELESS BUCKET                5.98
37     166.0      COLOR PHILADELPHIA                5.98
38     169.0           COMFORTS RUSH                5.98
39     181.0       CONTACT ANONYMOUS                5.98
40     220.0          DEER VIRGINIAN                5.98
41      45.0       ATTRACTION NEWTON                4.99
42      46.0             AUTUMN CROW                4.99
43      60.0         BEAST HUNCHBACK                4.99
44      61.0           BEAUTY GREASE                4.99
45      65.0        BEHAVIOR RUNAWAY                4.99
46      68.0           BETRAYED REAR                4.99
47      70.0        BIKINI BORROWERS                4.99
48      75.0       BIRD INDEPENDENCE                4.99
49      77.0         BIRDS PERDITION                4.99
50      81.0           BLINDNESS GUN                4.99
51      98.0       BRIGHT ENCOUNTERS                4.99
52     113.0        CALIFORNIA BIRDS                4.99
53     120.0       CARIBBEAN LIBERTY                4.99
54     126.0       CASUALTIES ENCINO                4.99
55     134.0     CHAMPION FLATLINERS                4.99
56     139.0           CHASING FIGHT                4.99
57     141.0           CHICAGO NORTH                4.99
58     145.0         CHISUM BEHAVIOR                4.99
59     151.0    CINCINATTI WHISPERER                4.99
60     156.0           CLERKS ANGELS                4.99
61     172.0       CONEHEADS SMOOCHY                4.99
62     173.0     CONFESSIONS MAGUIRE                4.99
63     177.0       CONNECTICUT TRAMP                4.99
64     182.0          CONTROL ANTHEM                4.99
65     190.0           CREEPERS KANE                4.99
66     210.0            DARKO DORADO                4.99
67     212.0          DARN FORRESTER                4.99
68     216.0          DAY UNFAITHFUL                4.99
69     219.0            DEEP CRUSADE                4.99
70       5.0             AFRICAN EGG                2.99
71      16.0         ALLEY EVOLUTION                2.99
72      30.0       ANYTHING SAVANNAH                2.99
73      50.0         BAKED CLEOPATRA                2.99
74      51.0        BALLOON HOMEWARD                2.99
75      56.0     BAREFOOT MANCHURIAN                2.99
76      57.0              BASIC EASY                2.99
77      67.0            BERETS AGENT                2.99
78      80.0         BLANKET BEVERLY                2.99
79     104.0              BUGSY SONG                2.99
80     116.0     CANDIDATE PERDITION                2.99
81     137.0          CHARADE DUFFEL                2.99
82     150.0            CIDER DESIRE                2.99
83     152.0            CIRCUS YOUTH                2.99
84     154.0            CLASH FREDDY                2.99
85     187.0        CRANES RESERVOIR                2.99
86     197.0           CRUSADE HONEY                2.99
87     201.0          CYCLONE FAMILY                2.99
88     208.0             DARES PLUTO                2.99
89     209.0            DARKNESS WAR                2.99
90     109.0      BUTTERFLY CHOCOLAT                2.97
91     130.0          CELEBRITY HORN                2.97
92     140.0           CHEAPER CLYDE                2.97
93     142.0    CHICKEN HELLFIGHTERS                2.97
94     164.0           COAST RAINBOW                2.97
95       1.0        ACADEMY DINOSAUR                1.98
96      11.0         ALAMO VIDEOTAPE                1.98
97      12.0          ALASKA PHANTOM                1.98
98      18.0           ALTER VICTORY                1.98
99      26.0          ANNIE IDENTITY                1.98
100     40.0        ARMY FLINTSTONES                1.98
101     54.0        BANGER PINOCCHIO                1.98
102     79.0            BLADE POLISH                1.98
103     82.0         BLOOD ARGONAUTS                1.98
104     89.0     BORROWERS BEDAZZLED                1.98
105    101.0     BROTHERHOOD BLANKET                1.98
106    114.0        CAMELOT VACATION                1.98
107    132.0         CHAINSAW UPTOWN                1.98
108    186.0          CRAFT OUTFIELD                1.98
109    200.0       CURTAIN VIDEOTAPE                1.98
110    206.0           DANCING FEVER                1.98
111     17.0              ALONE TRIP                0.99
112     19.0            AMADEUS HOLY                0.99
113     23.0    ANACONDA CONFESSIONS                0.99
114     34.0            ARABIA DOGMA                0.99
115     39.0         ARMAGEDDON LOST                0.99
116     52.0    BALLROOM MOCKINGBIRD                0.99
117     63.0       BEDAZZLED MARRIED                0.99
118     90.0           BOULEVARD MOB                0.99
119     97.0          BRIDE INTRIGUE                0.99
120    110.0             CABIN FLASH                0.99
121    111.0         CADDYSHACK JEDI                0.99
122    119.0           CAPER MOTIONS                0.99
123    143.0              CHILL LUCK                0.99
124    147.0          CHOCOLAT HARRY                0.99
125    149.0     CHRISTMAS MOONSHINE                0.99
126    155.0         CLEOPATRA DEVIL                0.99
127    160.0           CLUB GRAFFITI                0.99
128    176.0      CONGENIALITY QUEST                0.99
129    178.0  CONNECTION MICROCOSMOS                0.99
130    191.0         CROOKED FROGMEN                0.99
131    196.0      CRUELTY UNFORGIVEN                0.99
132    204.0       DALMATIONS SWEDEN                0.99
133    213.0              DATE SPEED                0.99
134    218.0       DECEIVER BETRAYED                0.99
135      NaN                    None                 NaN

In [ ]:
# 12. ELIMINAR LA TABLA

#pd.read_sql('''

#DROP TABLE TOTAL_RENTING_COST

#''', cursor)